# Application install
#	Author: Nick Iodice, adapted from a script
#			written by Dave Hand
#	Dependencies:
#		1. Homebrew
#		2. Cask
#

tap 'caskroom/cask'

brew 'archey'
brew 'python3'
brew 'bash'
brew 'bash-completion'
brew 'brew-cask'
brew 'cowsay'
brew 'ctags'
brew 'fortune'
brew 'git'
brew 'node'
brew 'openssl'
brew 'python' #installs pip as well
brew 'vim'

# Omitted:
#	1. Microsoft OneNote

cask 'alfred'
cask 'android-studio'
cask 'appcleaner'
cask 'dropbox'
cask 'spectacle'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-hangouts'
cask 'handbrake'
cask 'intellij-idea'
cask 'java'
cask 'macdown'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'textwrangler'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'xquartz' #required by wireshark
cask 'wireshark'
